Revit 2024 API
AnalysisDisplayColorSettings.MaxColor Property
 Color assigned to the maximum value.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2011
Syntax
C#
public Color MaxColor { get; set; }
Visual Basic
Public Property MaxColor As Color
	Get
	Set
Visual C++
public:
property Color^ MaxColor {
	Color^ get ();
	void set (Color^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
AnalysisDisplayColorSettings Class
Autodesk.Revit.DB.Analysis Namespace